Documents/бит_СобраниеТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_СобраниеТСЖ</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПроведенияCобрания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательСобрания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекретарьСобрания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТСЖ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСобрания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ФормыСобраний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокВопросов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>999</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кворум</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_Кворум</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КритерийОценкиГолосов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_КритерииОценкиГолосов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеВСлучаеОтклоненияРешения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>999</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеВСлучаеПринятияРешения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>999</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Участники</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыУчастниковГолосования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыВыбораГолосования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантРешения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>999</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВопроса</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УчастникиГолосования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеГолоса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВопроса</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРешения</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квартира</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РезультатыГолосования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеГолоса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВопроса</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРешения</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПринятоеРешение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентГолосов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ИнформацияТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ИнформацияТСЖ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Председатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролирующийОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОрганыФМС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТСЖ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ЧленыТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЧленыТСЖ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолосов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТСЖ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_КритерииОценкиГолосов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_КритерииОценкиГолосов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДолиПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличествуГолосов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличествуПроживающих</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_Кворум.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_Кворум</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Более12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеМеньше23</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеМеньше34</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Единогласно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ВидыУчастниковГолосования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыУчастниковГолосования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Собственики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧленыТСЖ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_СтатусПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СтатусПроживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Временно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроживает</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_СобраниеТСЖ/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Процедура УдалитьПоСтроке(ИД)
	
	Отбор = Новый Структура("ИдентификаторВопроса", ИД);
	МассивСтрок = Объект.ВариантыВыбораГолосования.НайтиСтроки(Отбор);
	
	Для каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
		
		Объект.ВариантыВыбораГолосования.Удалить(СтрокаТабличнойЧасти);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеУровни(ИмяДерева)
	
	Таблица = Этаформа[ИмяДерева].ПолучитьЭлементы();
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
		РазвернутьУровень(ИмяДерева, СтрокаТаблицы.ПолучитьИдентификатор());
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура РазвернутьУровень(ИмяДерева, Идентификатор)
	
	СтрокаДерева = ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(Идентификатор);
	
	Если СтрокаДерева = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Элементы[ИмяДерева].Развернуть(Идентификатор);
	
	Таблица = СтрокаДерева.ПолучитьЭлементы();
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
		РазвернутьУровень(ИмяДерева, СтрокаТаблицы.ПолучитьИдентификатор());
	КонецЦикла;  
	
КонецПроцедуры // () 

&НаКлиенте
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьСписокВопросов()
	
	СписокВопросов = Новый СписокЗначений;
	
	Для каждого СтрокаТаблицы Из Объект.СписокВопросов Цикл
		СписокВопросов.Добавить(СтрокаТаблицы.Идентификатор, СтрокаТаблицы.Вопрос);
	КонецЦикла;
	
	Возврат СписокВопросов;
	
КонецФункции // ()

&НаКлиенте
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьСписокРешенийПоВопросу(ИдентификаторВопроса)
	
	СписокРешений = Новый СписокЗначений;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторВопроса", ИдентификаторВопроса);
	
	ПоискРешений = Объект.ВариантыВыбораГолосования.НайтиСтроки(Отбор);
	
	Для каждого СтрокаТаблицы Из ПоискРешений Цикл
		СписокРешений.Добавить(СтрокаТаблицы.Идентификатор, СтрокаТаблицы.ВариантРешения);
	КонецЦикла;
	
	Возврат СписокРешений;
	
КонецФункции // ()

&НаКлиенте
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура УстановитьФлажкиДерева(Установить = Ложь, Идентификатор = Неопределено)
	
	Если НЕ Идентификатор = Неопределено Тогда
		
		СтрокаДерева = ДеревоУчастниковГолосования.НайтиПоИдентификатору(Идентификатор);
		
		Если СтрокаДерева = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		
		Таблица = СтрокаДерева.ПолучитьЭлементы();
		
	Иначе
		Таблица = ДеревоУчастниковГолосования.ПолучитьЭлементы();
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
		
		СтрокаТаблицы.Использовать = ?(СтрокаТаблицы.УровеньУчастник, Установить, Ложь);
		
		УстановитьФлажкиДерева(Установить, СтрокаТаблицы.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
КонецПроцедуры // () 

&НаКлиенте
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура УстановитьТекстСообщений()
	
	ТекстОшибки        = "";
	ШаблонТекстаОшибки = "Изменения: %1.";
	
	Если ИзменилсяСписокЗданий Тогда
		ТекстОшибки = ТекстОшибки + НСтр("ru = ', список зданий'");
	КонецЕсли;
	
	Если ИзменилосьПредставлениеВопроса Тогда
		ТекстОшибки = ТекстОшибки + НСтр("ru = ', список вопросов'");
	КонецЕсли;
	
	Если ИзменилосьПредставлениеРешения Тогда
		ТекстОшибки = ТекстОшибки + НСтр("ru = ', список вариантов решений'");
	КонецЕсли;
	
	Если НесовпадаетКолГолосов Тогда
		ТекстОшибки = ТекстОшибки + НСтр("ru = ', несовпадает кол-во голосов'");
	КонецЕсли;
	
	ТекстОшибки = Сред(ТекстОшибки,3);
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, ТекстОшибки);
	КонецЕсли; 
	
	ЦветОшибки    = WebЦвета.Красный;
	ЦветПусто     = WebЦвета.НебесноГолубой;
	ЦветЗаполнено = WebЦвета.ЛимонноЗеленый;
	
	КолУг = ДеревоУчастниковГолосования.ПолучитьЭлементы().Количество();
	КолРч = ДеревоРзельтатовГолосования.ПолучитьЭлементы().Количество();
	
	ТаблицаУчастниковНеАктуальна  = ?(ТаблицаУчастниковНеАктуальна, КолУг > 0, ТаблицаУчастниковНеАктуальна);
	ТаблицаРезультатовНеАктуальна = ?(ТаблицаРезультатовНеАктуальна, КолРч > 0, ТаблицаРезультатовНеАктуальна);
	
	Если ТаблицаУчастниковНеАктуальна Тогда
		
		ШаблонТекстаЗаголовока = НСтр("ru = 'Список участников голосования не актуален. Выполните команду ""Обновить"". %1'");
		Элементы.ТекстУчастники.Заголовок  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаЗаголовока, ТекстОшибки);
		Элементы.ТекстУчастники.ЦветТекста = ЦветОшибки;
		
	Иначе
		
		Если КолУг = 0 Тогда
			Элементы.ТекстУчастники.Заголовок  = НСтр("ru = 'Список участников голосования пуст. Выполните команду ""Обновить"".'");
			Элементы.ТекстУчастники.ЦветТекста = ЦветПусто;
		Иначе
			Элементы.ТекстУчастники.Заголовок  = НСтр("ru = 'Список участников голосования обновлен.'");
			Элементы.ТекстУчастники.ЦветТекста = ЦветЗаполнено;
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ТаблицаРезультатовНеАктуальна Тогда
		ШаблонТекстаЗаголовока = НСтр("ru = 'Список результатов голосования не актуален. Выполните команду ""Обновить"". %1'");
		Элементы.ТекстРезультаты.Заголовок  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаЗаголовока, ТекстОшибки);
		Элементы.ТекстРезультаты.ЦветТекста = ЦветОшибки;
	Иначе
		
		Если КолРч = 0 Тогда
			Элементы.ТекстРезультаты.Заголовок  = НСтр("ru = 'Список результатов голосования пуст. Выполните команду ""Обновить"".'");
			Элементы.ТекстРезультаты.ЦветТекста = ЦветПусто;
		Иначе
			Элементы.ТекстРезультаты.Заголовок  = НСтр("ru = 'Список результатов голосования обновлен.'");
			Элементы.ТекстРезультаты.ЦветТекста = ЦветЗаполнено;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если (НЕ ТаблицаУчастниковНеАктуальна И НЕ ТаблицаРезультатовНеАктуальна) Тогда
		
		ИзменилсяСписокЗданий          = Ложь;
		ИзменилосьПредставлениеВопроса = Ложь;
		ИзменилосьПредставлениеРешения = Ложь;
		НесовпадаетКолГолосов          = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьТекстСообщений()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ЗапонлитьДеревоПоОбъекту();
	КонецЕсли;
	
	бит_УправлениеПечатьюСервер.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.УчастникиГолосования.Очистить();
	
	УровеньВопрос = ДеревоУчастниковГолосования.ПолучитьЭлементы();
	
	Для каждого СтрокаВопрос Из УровеньВопрос Цикл
		УровеньЗдание = СтрокаВопрос.ПолучитьЭлементы();
		Для каждого СтрокаЗдание Из УровеньЗдание Цикл
			УровеньУчастник = СтрокаЗдание.ПолучитьЭлементы();
			Для каждого СтрокаУчастник Из УровеньУчастник Цикл
				
				НоваяСтрока = ТекущийОбъект.УчастникиГолосования.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУчастник); 
				НоваяСтрока.Здание   = СтрокаЗдание.ЗданиеУчастник;
				НоваяСтрока.Участник = СтрокаУчастник.ЗданиеУчастник;
				
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла;
	
	ТекущийОбъект.РезультатыГолосования.Очистить();
	
	УровеньВопрос = ДеревоРзельтатовГолосования.ПолучитьЭлементы();
	
	Для каждого СтрокаВопрос Из УровеньВопрос Цикл
		УровеньРешение = СтрокаВопрос.ПолучитьЭлементы();
		Для каждого СтрокаРешение Из УровеньРешение Цикл
			
			НоваяСтрока = ТекущийОбъект.РезультатыГолосования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРешение); 
			
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекстСообщений();
	РазвернутьВсеУровни("ДеревоРзельтатовГолосования");
	РазвернутьВсеУровни("ДеревоУчастниковГолосования");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ТаблицаУчастниковНеАктуальна ИЛИ ТаблицаРезультатовНеАктуальна Тогда
		
		Отказ = Истина;
		ШаблонТекстаОшибки = НСтр("ru = 'На форме обнаружены ошибки: %1.'");
		ТекстОшибки = "";
		
		Если ТаблицаУчастниковНеАктуальна Тогда
			ТекстОшибки = НСтр("ru = ', не актуален список участников голосований'"); 
		КонецЕсли;
		
		Если ТаблицаРезультатовНеАктуальна Тогда
			ТекстОшибки = НСтр("ru = ', не актуален список результата голосований'"); 
		КонецЕсли;
		
		ТекстОшибки = Сред(ТекстОшибки,3);
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, ТекстОшибки);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ОбновитьВсе(Команда)
	
	ОбновитьСписокГолосований();
	РазвернутьВсеУровни("ДеревоУчастниковГолосования");
	
	ТаблицаУчастниковНеАктуальна  = Ложь;
	ТаблицаРезультатовНеАктуальна = Истина;
	
	УстановитьТекстСообщений();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРешения(Команда)
	
	ОбновитьДеревоРешенийНаСервере();
	РазвернутьВсеУровни("ДеревоРзельтатовГолосования");
	
	ТаблицаРезультатовНеАктуальна  = Ложь;
	
	УстановитьТекстСообщений();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьФлажкиДерева(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьФлажкиДерева();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРешенияПоВопросуТекущейСтроки(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоУчастниковГолосования.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ИдентификаторВопроса = ТекущаяСтрока.ИдентификаторВопроса;
	
	ВариантРешения = Новый Структура("ИдентификаторРешения, Решение");
	
	ЗаполнитьЗначениеПоДереву(ИдентификаторВопроса, ВариантРешения);
	
	РазвернутьВсеУровни("ДеревоУчастниковГолосования");
	
	НесовпадаетКолГолосов     = Истина;
	ТаблицаРезультатовНеАктуальна = Истина;
	
	УстановитьТекстСообщений();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРешенияПоВпоросуТекущейСтроки(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоУчастниковГолосования.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ИдентификаторВопроса = ТекущаяСтрока.ИдентификаторВопроса;
	
	СписокРешений = ПолучитьСписокРешенийПоВопросу(ИдентификаторВопроса);
	
	ВыбранноеРешение = СписокРешений.ВыбратьЭлемент("Выберите выриант решения");
	
	Если ВыбранноеРешение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВариантРешения = Новый Структура("ИдентификаторРешения, Решение");
	ВариантРешения.ИдентификаторРешения = ВыбранноеРешение.Значение;
	ВариантРешения.Решение              = ВыбранноеРешение.Представление;
	
	ЗаполнитьЗначениеПоДереву(ИдентификаторВопроса, ВариантРешения);
	
	РазвернутьВсеУровни("ДеревоУчастниковГолосования");
	
	НесовпадаетКолГолосов     = Истина;
	ТаблицаРезультатовНеАктуальна = Истина;
	
	УстановитьТекстСообщений();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРешение(Команда)
	
	СписокВопросов = ПолучитьСписокВопросов();
	
	ВыбранныйВопрос = СписокВопросов.ВыбратьЭлемент("Выберите вопрос");
	
	Если ВыбранныйВопрос = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторВопроса = ВыбранныйВопрос.Значение; 
	
	СписокРешений = ПолучитьСписокРешенийПоВопросу(ИдентификаторВопроса);
	
	ВыбранноеРешение = СписокРешений.ВыбратьЭлемент("Выберите выриант решения");
	
	Если ВыбранноеРешение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВариантРешения = Новый Структура("ИдентификаторРешения, Решение");
	ВариантРешения.ИдентификаторРешения = ВыбранноеРешение.Значение;
	ВариантРешения.Решение              = ВыбранноеРешение.Представление;
	
	ЗаполнитьЗначениеПоДереву(ИдентификаторВопроса, ВариантРешения);
	
	РазвернутьВсеУровни("ДеревоУчастниковГолосования");
	
	НесовпадаетКолГолосов     = Истина;
	ТаблицаРезультатовНеАктуальна = Истина;
	
	УстановитьТекстСообщений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисититьПринятиеРешения(Команда)
	
	СписокВопросов = ПолучитьСписокВопросов();
	
	ВыбранныйВопрос = СписокВопросов.ВыбратьЭлемент("Выберите вопрос");
	
	Если ВыбранныйВопрос = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВариантРешения = Новый Структура("ИдентификаторРешения, Решение");
	
	ЗаполнитьЗначениеПоДереву(ВыбранныйВопрос.Значение, ВариантРешения);
	
	РазвернутьВсеУровни("ДеревоУчастниковГолосования");
	
	НесовпадаетКолГолосов     = Истина;
	ТаблицаРезультатовНеАктуальна = Истина;
	
	УстановитьТекстСообщений();
	
КонецПроцедуры

&НаКлиенте
Процедура УстновитьЗначениеГолосов(Команда)
	
	СписокВопросов = ПолучитьСписокВопросов();
	
	ВыбранныйВопрос = СписокВопросов.ВыбратьЭлемент("Выберите вопрос");
	
	Если ВыбранныйВопрос = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторВопроса = ВыбранныйВопрос.Значение;
	
	ВыбЗнач = 0;
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	КЧ = Новый КвалификаторыЧисла(10,0);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КЧ);
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("УстновитьЗначениеГолосовЗавершение", ЭтотОбъект, Новый Структура("ИдентификаторВопроса, ВыбЗнач", ИдентификаторВопроса, ВыбЗнач)), ВыбЗнач, "Введите значение", ОписаниеТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура УстновитьЗначениеГолосовЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	ИдентификаторВопроса = ДополнительныеПараметры.ИдентификаторВопроса;
	ВыбЗнач = ?(Значение = Неопределено, ДополнительныеПараметры.ВыбЗнач, Значение);
	
	Если НЕ (Значение <> Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("КритерийОценкиГолосов", ПредопределенноеЗначение("Перечисление.бит_КритерииОценкиГолосов.ПоКоличествуГолосов"));
	
	СтруктураЗначений = Новый Структура;
	СтруктураЗначений.Вставить("ЗначениеГолоса", ВыбЗнач);
	
	ЗаполнитьЗначениеПоДереву(ИдентификаторВопроса, СтруктураЗначений, Отбор);
	
	РазвернутьВсеУровни("ДеревоУчастниковГолосования");
	
	НесовпадаетКолГолосов         = Истина;
	ТаблицаРезультатовНеАктуальна = Истина;
	
	УстановитьТекстСообщений();
	
КонецПроцедуры

&НаКлиенте
Процедура УстновитьЗначениеГолосовПоВопросуТекущейСтроки(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоУчастниковГолосования.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ИдентификаторВопроса = ТекущаяСтрока.ИдентификаторВопроса;
	
	ВыбЗнач = 0;
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	КЧ = Новый КвалификаторыЧисла(10,0);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КЧ);
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("УстновитьЗначениеГолосовПоВопросуТекущейСтрокиЗавершение", ЭтотОбъект, Новый Структура("ИдентификаторВопроса, ВыбЗнач", ИдентификаторВопроса, ВыбЗнач)), ВыбЗнач, "Введите значение", ОписаниеТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура УстновитьЗначениеГолосовПоВопросуТекущейСтрокиЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	ИдентификаторВопроса = ДополнительныеПараметры.ИдентификаторВопроса;
	ВыбЗнач = ?(Значение = Неопределено, ДополнительныеПараметры.ВыбЗнач, Значение);
	
	Если НЕ (Значение <> Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("КритерийОценкиГолосов", ПредопределенноеЗначение("Перечисление.бит_КритерииОценкиГолосов.ПоКоличествуГолосов"));
	
	СтруктураЗначений = Новый Структура;
	СтруктураЗначений.Вставить("ЗначениеГолоса", ВыбЗнач);
	
	ЗаполнитьЗначениеПоДереву(ИдентификаторВопроса, СтруктураЗначений, Отбор);
	
	РазвернутьВсеУровни("ДеревоУчастниковГолосования");
	
	НесовпадаетКолГолосов         = Истина;
	ТаблицаРезультатовНеАктуальна = Истина;
	
	УстановитьТекстСообщений();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	бит_УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТСЖНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьСписокТСЖ(Объект.Дата, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ТСЖОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДеревоРез = ДеревоРзельтатовГолосования.ПолучитьЭлементы();
	ДеревоУч  = ДеревоУчастниковГолосования.ПолучитьЭлементы();
	
	Если НЕ ВыбранноеЗначение = Объект.ТСЖ Тогда
		
		Если НЕ ДеревоРез.Количество() = 0 ИЛИ НЕ ДеревоУч.Количество() = 0 Тогда
			
			Ответ = Неопределено;
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ТСЖОбработкаВыбораЗавершение", ЭтотОбъект, Новый Структура("ДеревоРез, ДеревоУч, СтандартнаяОбработка", ДеревоРез, ДеревоУч, СтандартнаяОбработка)), "Список участников и результаты голосования будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТСЖОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ДеревоРез = ДополнительныеПараметры.ДеревоРез;
	ДеревоУч = ДополнительныеПараметры.ДеревоУч;
	СтандартнаяОбработка = ДополнительныеПараметры.СтандартнаяОбработка;
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ДеревоРез.Очистить();
		ДеревоУч.Очистить();
		Объект.УчастникиГолосования.Очистить();
		Объект.РезультатыГолосования.Очистить();
		
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТСЖПриИзменении(Элемент)
	
	ОбновитьСписокЗданийНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредседательСобранияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая", ,Элемент);
	
	Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
	Эл.ПравоеЗначение   = ДобавитьОтборПроживающих();
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

&НаКлиенте
Процедура СекретарьСобранияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая", ,Элемент);
	
	Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
	Эл.ПравоеЗначение   = ДобавитьОтборПроживающих();
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСписокЗданий

&НаКлиенте
Процедура СписокЗданийИспользоватьПриИзменении(Элемент)
	
	ИзменилсяСписокЗданий         = Истина;
	ТаблицаРезультатовНеАктуальна = Истина;
	ТаблицаУчастниковНеАктуальна  = Истина;
	
	УстановитьТекстСообщений();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляВопросы

&НаКлиенте
Процедура ВопросыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.Вопросы.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НоваяСтрока ИЛИ Копирование Тогда
		
		ТекущаяСтрока.Идентификатор = Новый УникальныйИдентификатор;
		
		Если НЕ Копирование Тогда
			ТекущаяСтрока.Кворум                = ПредопределенноеЗначение("Перечисление.бит_Кворум.Единогласно");
			ТекущаяСтрока.Участники             = ПредопределенноеЗначение("Перечисление.бит_ВидыУчастниковГолосования.ЧленыТСЖ");
			ТекущаяСтрока.КритерийОценкиГолосов = ПредопределенноеЗначение("Перечисление.бит_КритерииОценкиГолосов.ПоКоличествуГолосов");
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Вопросы.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		СтруктураПараметров = Новый Структура("ИдентификаторВопроса", ТекущаяСтрока.Идентификатор);
		Элементы.ВариантыВыбораГолосования.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПараметров);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Вопросы.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		УдалитьПоСтроке(ТекущиеДанные.Идентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВопросПриИзменении(Элемент)
	
	ИзменилосьПредставлениеВопроса = Истина;
	ТаблицаУчастниковНеАктуальна   = Истина;
	ТаблицаРезультатовНеАктуальна  = Истина;
	УстановитьТекстСообщений();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыКворумПриИзменении(Элемент)
	
	ИзменилосьПредставлениеВопроса = Истина;
	ТаблицаРезультатовНеАктуальна  = Истина;
	УстановитьТекстСообщений();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыУчастникиПриИзменении(Элемент)
	
	ИзменилосьПредставлениеВопроса = Истина;
	ТаблицаУчастниковНеАктуальна   = Истина;
	ТаблицаРезультатовНеАктуальна  = Истина;
	УстановитьТекстСообщений();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыКритерийОценкиГолосаПриИзменении(Элемент)
	
	НесовпадаетКолГолосов          = Истина;
	ТаблицаУчастниковНеАктуальна   = Истина;
	ТаблицаРезультатовНеАктуальна  = Истина;
	УстановитьТекстСообщений();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляВариантыВыбораГолосования

&НаКлиенте
Процедура ВариантыВыбораГолосованияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущийВопрос = Элементы.Вопросы.ТекущиеДанные;
	
	Если ТекущийВопрос = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ВариантыВыбораГолосования.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НоваяСтрока ИЛИ Копирование Тогда
		ТекущаяСтрока.ИдентификаторВопроса = ТекущийВопрос.Идентификатор;
		ТекущаяСтрока.Идентификатор        = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыВыбораГолосованияВариантРешенияПриИзменении(Элемент)
	
	ТаблицаРезультатовНеАктуальна  = Истина;
	ТаблицаУчастниковНеАктуальна   = Истина;
	ИзменилосьПредставлениеРешения = Истина;
	
	УстановитьТекстСообщений();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляДеревоУчастниковГолосования

&НаКлиенте
Процедура ДеревоУчастниковГолосованияПредставлениеЗданияУчастникаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ДеревоУчастниковГолосования.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЗданиеУчастник) Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(ТекущаяСтрока.ЗданиеУчастник) = Тип("СправочникСсылка.бит_СписокЗданий") 
		ИЛИ ТипЗнч(ТекущаяСтрока.ЗданиеУчастник) = Тип("СправочникСсылка.бит_Проживающие") Тогда
		
		ПоказатьЗначение(,ТекущаяСтрока.ЗданиеУчастник);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУчастниковГолосованияРешениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ДеревоУчастниковГолосования.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Отбор = Новый Структура("ИдентификаторВопроса", ТекущаяСтрока.ИдентификаторВопроса);
	
	Поиск = Объект.ВариантыВыбораГолосования.НайтиСтроки(Отбор);
	
	СписокВариантов = Новый СписокЗначений;
	
	Для каждого СтрокаТаблицы Из Поиск Цикл
		СписокВариантов.Добавить(СтрокаТаблицы.Идентификатор, СтрокаТаблицы.ВариантРешения);
	КонецЦикла;
	
	Вариант = Неопределено;
	
	СписокВариантов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ДеревоУчастниковГолосованияРешениеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекущаяСтрока", ТекущаяСтрока)), "Варианты выбора голосования."); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУчастниковГолосованияРешениеНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ТекущаяСтрока = ДополнительныеПараметры.ТекущаяСтрока;
	
	Вариант = ВыбранныйЭлемент;
	
	Если НЕ Вариант = Неопределено Тогда
		
		ТекущаяСтрока.Решение              = Вариант.Представление;
		ТекущаяСтрока.ИдентификаторРешения = Вариант.Значение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУчастниковГолосованияКоличествоГолосовПриИзменении(Элемент)
	
	НесовпадаетКолГолосов          = Истина;
	ТаблицаРезультатовНеАктуальна  = Истина;
	УстановитьТекстСообщений();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУчастниковГолосованияПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервереБезКонтекста
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьСписокТСЖ(Период, Организация)
	
	СписокТСЖ = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , КонецДня(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ
	|ИЗ
	|	РегистрСведений.бит_ИнформацияТСЖ.СрезПоследних(&Период, ) КАК бит_ИнформацияТСЖСрезПоследних
	|ГДЕ
	|	(бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия > &Период)
	|	И бит_ИнформацияТСЖСрезПоследних.Здание.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Таблица = Результат.Выгрузить();
		СписокТСЖ.ЗагрузитьЗначения(Таблица.ВыгрузитьКолонку("ТСЖ"));
		
	КонецЕсли; 
	
	Возврат СписокТСЖ;
	
КонецФункции // ПолучитьСписокТСЖ()

&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОбновитьСписокЗданийНаСервере()
	
	Объект.СписокЗданий.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ТСЖ"        , Объект.ТСЖ);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ИнформацияТСЖСрезПоследних.Здание
	|ИЗ
	|	РегистрСведений.бит_ИнформацияТСЖ.СрезПоследних(&Период, ТСЖ = &ТСЖ) КАК бит_ИнформацияТСЖСрезПоследних
	|ГДЕ
	|	(бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия > &Период)
	|	И бит_ИнформацияТСЖСрезПоследних.Здание.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ИнформацияТСЖСрезПоследних.Здание";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.СписокЗданий.Добавить();
		НоваяСтрока.Здание       = Выборка.Здание;
		НоваяСтрока.Использовать = Истина;
		
	КонецЦикла;
	
КонецПроцедуры // ОбновитьСписокЗданийНаСервере() 

&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОбновитьСписокГолосований()
	
	ДеревоУчастников = РеквизитФормыВЗначение("ДеревоУчастниковГолосования", Тип("ДеревоЗначений"));
	
	ПервыйУровень = ДеревоУчастников.Строки; // Вопросы
	
	Для каждого СтрокаСписокВопросов Из Объект.СписокВопросов Цикл
		
		ИдентификаторВопроса = СтрокаСписокВопросов.Идентификатор;
		
		СтрокаВопрос = ПервыйУровень.Найти(ИдентификаторВопроса, "ИдентификаторВопроса", Истина);
		
		Если СтрокаВопрос = Неопределено Тогда
			
			СтрокаВопрос = ПервыйУровень.Добавить();
			СтрокаВопрос.Представление        = СтрокаСписокВопросов.Вопрос;
			СтрокаВопрос.ИдентификаторВопроса = ИдентификаторВопроса;
			
		КонецЕсли;
		
		Если НЕ СтрокаВопрос = Неопределено Тогда
			СтрокаВопрос.Представление = СтрокаСписокВопросов.Вопрос;
			СтрокаВопрос.УровеньВопрос = Истина;
		КонецЕсли;
		
		Попытка
			ВторойУровень = СтрокаВопрос.Строки; // Здания.
		Исключение
			Продолжить;
		КонецПопытки; 
		
		Для каждого СтрокаТаблицы Из Объект.СписокЗданий Цикл
			
			СтрокаЗдание = ВторойУровень.Найти(СтрокаТаблицы.Здание, "ЗданиеУчастник", Истина);
			
			Если СтрокаЗдание = Неопределено И СтрокаТаблицы.Использовать Тогда
				
				СтрокаЗдание = ВторойУровень.Добавить();
				СтрокаЗдание.ЗданиеУчастник       = СтрокаТаблицы.Здание;
				СтрокаЗдание.ИдентификаторВопроса = ИдентификаторВопроса;
				СтрокаЗдание.УровеньЗдание        = Истина;
				СтрокаЗдание.Представление        = "ул. " + СтрокаТаблицы.Здание.Улица + ", д." + СтрокаТаблицы.Здание;
				
			ИначеЕсли НЕ СтрокаТаблицы.Использовать И НЕ СтрокаЗдание = Неопределено Тогда
				
				ВторойУровень.Удалить(СтрокаЗдание);
				Продолжить;
				
			КонецЕсли;
			
			Попытка
				ТретийУровень = СтрокаЗдание.Строки; // Участники.
			Исключение
				Продолжить;
			КонецПопытки;
			
			СписокЗданий = Новый Массив;
			СписокЗданий.Добавить(СтрокаТаблицы.Здание);
			
			ТолькоСобственики = СтрокаСписокВопросов.Участники = Перечисления.бит_ВидыУчастниковГолосования.Собственики;
			
			СписокУчастников = ПолучитьСписокУчастников(Объект.Дата, Объект.ТСЖ, СписокЗданий, ТолькоСобственики);
			
			тмпУчастники = СкопироватьУровень(ТретийУровень, "ЗданиеУчастник", "ИдентификаторРешения");
			ТретийУровень.Очистить();
			
			Для каждого СтрокаТаблицы Из СписокУчастников Цикл
				
				СтрокаУчастник = ТретийУровень.Добавить();
				СтрокаУчастник.Использовать         = Истина;
				СтрокаУчастник.Квартира             = СтрокаТаблицы.Квартира;
				СтрокаУчастник.ЗданиеУчастник       = СтрокаТаблицы.ФизЛицо;
				СтрокаУчастник.ИдентификаторВопроса = ИдентификаторВопроса;
				СтрокаУчастник.Представление        = "" + СтрокаТаблицы.ФизЛицо + ", кв." + СтрокаТаблицы.Квартира;
				СтрокаУчастник.УровеньУчастник      = Истина;
				СтрокаУчастник.КритерийОценкиГолосов = СтрокаСписокВопросов.КритерийОценкиГолосов;
				
				Если СтрокаСписокВопросов.КритерийОценкиГолосов = Перечисления.бит_КритерииОценкиГолосов.ПоДолиПлощади Тогда
					СтрокаУчастник.ЗначениеГолоса = СтрокаТаблицы.ДоляПлощади;
				ИначеЕсли СтрокаСписокВопросов.КритерийОценкиГолосов = Перечисления.бит_КритерииОценкиГолосов.ПоКоличествуГолосов Тогда
					СтрокаУчастник.ЗначениеГолоса = СтрокаТаблицы.КоличествоГолосов;
					СтрокаУчастник.ЗначениеГолоса    = ?(СтрокаУчастник.ЗначениеГолоса = 0, 1, СтрокаУчастник.ЗначениеГолоса);
				ИначеЕсли СтрокаСписокВопросов.КритерийОценкиГолосов = Перечисления.бит_КритерииОценкиГолосов.ПоКоличествуПроживающих Тогда
					СтрокаУчастник.ЗначениеГолоса = СтрокаТаблицы.КолПроживающих;
				КонецЕсли;
				
				ИдентификаторРешения =  тмпУчастники.Получить(СтрокаТаблицы.ФизЛицо);
				
				Если НЕ ИдентификаторРешения = Неопределено Тогда
					
					Отбор = Новый Структура("Идентификатор", ИдентификаторРешения);
					
					Поиск = Объект.ВариантыВыбораГолосования.НайтиСтроки(Отбор);
					
					Попытка
						СтрокаУчастник.ИдентификаторРешения = ИдентификаторРешения;
						СтрокаУчастник.Решение              = Поиск[0].ВариантРешения;
					Исключение
						Продолжить;
					КонецПопытки;
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоУчастников, "ДеревоУчастниковГолосования");
	
КонецПроцедуры // () 

&НаСервереБезКонтекста
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьСписокУчастников(Период, ТСЖ, СписокЗданий, ТолькоСобственики = Ложь)
	
	ИмяТаблицыСлева  = "СписокЧленовТСЖ";
	ИмяТаблицыСправа = "СписокСобствеников";
	
	Если ТолькоСобственики Тогда
		
		ИмяТаблицыСлева = "СписокСобствеников";
		ИмяТаблицыСправа  = "СписокЧленовТСЖ";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	Запрос.УстановитьПараметр("ТСЖ"   , ТСЖ);
	Запрос.УстановитьПараметр("СписокЗданий", СписокЗданий);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПроживающих,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|ПОМЕСТИТЬ Проживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Период, ЛицевойСчет.Здание В (&СписокЗданий)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Период)
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.Постоянно)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	1 КАК КоличествоГолосов,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Квартира КАК Квартира,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ДоляПлощади
	|ПОМЕСТИТЬ СписокСобствеников
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Период, ЛицевойСчет.Здание В (&СписокЗданий)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Период)
	|	И бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.даНет.да)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЧленыТСЖСрезПоследних.ФизЛицо,
	|	бит_ЧленыТСЖСрезПоследних.КоличествоГолосов,
	|	бит_ЧленыТСЖСрезПоследних.ЛицевойСчет.Квартира КАК Квартира,
	|	бит_ЧленыТСЖСрезПоследних.ЛицевойСчет,
	|	СписокСобствеников.ДоляПлощади
	|ПОМЕСТИТЬ СписокЧленовТСЖ
	|ИЗ
	|	РегистрСведений.бит_ЧленыТСЖ.СрезПоследних(
	|			&Период,
	|			ТСЖ = &ТСЖ
	|				И ЛицевойСчет.Здание В (&СписокЗданий)) КАК бит_ЧленыТСЖСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСобствеников КАК СписокСобствеников
	|		ПО бит_ЧленыТСЖСрезПоследних.ЛицевойСчет = СписокСобствеников.ЛицевойСчет
	|			И бит_ЧленыТСЖСрезПоследних.ФизЛицо = СписокСобствеников.ФизЛицо
	|			И бит_ЧленыТСЖСрезПоследних.ЛицевойСчет.Квартира = СписокСобствеников.Квартира
	|ГДЕ
	|	(бит_ЧленыТСЖСрезПоследних.ДатаВыхода = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ЧленыТСЖСрезПоследних.ДатаВыхода > &Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛеваяТаблица.ФизЛицо,
	|	ЕСТЬNULL(ЛеваяТаблица.КоличествоГолосов, 0) КАК КоличествоГолосов,
	|	ЛеваяТаблица.Квартира,
	|	ЛеваяТаблица.ЛицевойСчет,
	|	ЕСТЬNULL(Проживающие.КолПроживающих, 0) КАК КолПроживающих,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь, 0) * ЕСТЬNULL(ЛеваяТаблица.ДоляПлощади, 0) КАК ЧИСЛО(15, 2)) КАК ДоляПлощади
	|ИЗ
	|	"+ИмяТаблицыСлева+" КАК ЛеваяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
	|		ПО ЛеваяТаблица.ЛицевойСчет = Проживающие.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ "+ИмяТаблицыСправа+" КАК ПраваяТаблица
	|		ПО ЛеваяТаблица.ФизЛицо = ПраваяТаблица.ФизЛицо
	|			И ЛеваяТаблица.ЛицевойСчет = ПраваяТаблица.ЛицевойСчет
	|			И ЛеваяТаблица.Квартира = ПраваяТаблица.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Период, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО ЛеваяТаблица.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Проживающие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокСобствеников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокЧленовТСЖ";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ()

&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОбновитьДеревоРешенийНаСервере()
	
	ДеревоУчастников = РеквизитФормыВЗначение("ДеревоУчастниковГолосования", Тип("ДеревоЗначений"));
	
	ДеревоРезультата = РеквизитФормыВЗначение("ДеревоРзельтатовГолосования", Тип("ДеревоЗначений"));
	УровеньВопрос    = ДеревоРезультата.Строки;
	
	УровеньВопрос.Очистить();
	
	Для каждого СтрокаВопрос Из Объект.СписокВопросов Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторВопроса", СтрокаВопрос.Идентификатор);
		
		ПоискРешений = Объект.ВариантыВыбораГолосования.НайтиСтроки(Отбор);
		
		НоваяСтрокаВопрос = УровеньВопрос.Добавить();
		НоваяСтрокаВопрос.ИдентификаторВопроса = СтрокаВопрос.Идентификатор;
		НоваяСтрокаВопрос.Вопрос               = СтрокаВопрос.Вопрос;
		
		УровеньРешения = НоваяСтрокаВопрос.Строки;
		
		Для каждого СтрокаРешения Из ПоискРешений Цикл
			
			НоваяСтрокаРешения =  УровеньРешения.Добавить();
			НоваяСтрокаРешения.ИдентификаторВопроса = СтрокаВопрос.Идентификатор;
			НоваяСтрокаРешения.ИдентификаторРешения = СтрокаРешения.Идентификатор;
			НоваяСтрокаРешения.Вопрос               = СтрокаРешения.ВариантРешения;
			
			Отбор = Новый Структура;
			Отбор.Вставить("ИдентификаторРешения", СтрокаРешения.Идентификатор);
			Отбор.Вставить("УровеньУчастник"     , Истина);
			Отбор.Вставить("Использовать"        , Истина);
			
			ПоискУчастников = ДеревоУчастников.Строки.НайтиСтроки(Отбор, Истина);
			
			Для каждого СтрокаУчастник Из ПоискУчастников Цикл
				
				НоваяСтрокаРешения.ЗначениеГолоса = НоваяСтрокаРешения.ЗначениеГолоса + СтрокаУчастник.ЗначениеГолоса;
				
			КонецЦикла;  
			
		КонецЦикла;
		
		ПроцентноеЗначениеКворума = 100;
		
		Кворум = СтрокаВопрос.Кворум;
		
		Если Кворум = Перечисления.бит_Кворум.Более12 Тогда
			ПроцентноеЗначениеКворума = 50.01;
		ИначеЕсли Кворум = Перечисления.бит_Кворум.НеМеньше23 Тогда
			ПроцентноеЗначениеКворума = 66.67;
		ИначеЕсли Кворум = Перечисления.бит_Кворум.НеМеньше34 Тогда
			ПроцентноеЗначениеКворума = 25;
		КонецЕсли;
		
		ИтогЗначениеГолоса = УровеньРешения.Итог("ЗначениеГолоса");
		
		Если ИтогЗначениеГолоса = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Для каждого СтрокаТаблицы Из УровеньРешения Цикл
			
			СтрокаТаблицы.ПроцентГолосов = ОКР((СтрокаТаблицы.ЗначениеГолоса / ИтогЗначениеГолоса) * 100, 2);
			
			Если СтрокаТаблицы.ПроцентГолосов >= ПроцентноеЗначениеКворума Тогда
				СтрокаТаблицы.ПринятоеРешение = Истина;
			КонецЕсли; 
			
		КонецЦикла;
		
		НоваяСтрокаВопрос.ЗначениеГолоса = ИтогЗначениеГолоса;
		НоваяСтрокаВопрос.ПроцентГолосов    = 100;
		
	КонецЦикла; 
	
	ЗначениеВРеквизитФормы(ДеревоРезультата, "ДеревоРзельтатовГолосования");
	
КонецПроцедуры // () 

&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗапонлитьДеревоПоОбъекту()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Параметры.Ключ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокВопросов.Идентификатор,
	|	СписокВопросов.Вопрос,
	|	СписокВопросов.КритерийОценкиГолосов
	|ПОМЕСТИТЬ СписокВопросов
	|ИЗ
	|	Документ.бит_СобраниеТСЖ.СписокВопросов КАК СписокВопросов
	|ГДЕ
	|	СписокВопросов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыВыбораГолосования.Идентификатор,
	|	ВариантыВыбораГолосования.ИдентификаторВопроса,
	|	ВариантыВыбораГолосования.ВариантРешения
	|ПОМЕСТИТЬ ВариантыВыбораГолосования
	|ИЗ
	|	Документ.бит_СобраниеТСЖ.ВариантыВыбораГолосования КАК ВариантыВыбораГолосования
	|ГДЕ
	|	ВариантыВыбораГолосования.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчастникиГолосования.ИдентификаторВопроса КАК ИдентификаторВопроса,
	|	УчастникиГолосования.ИдентификаторРешения,
	|	УчастникиГолосования.Здание КАК Здание,
	|	УчастникиГолосования.Участник,
	|	УчастникиГолосования.ЗначениеГолоса,
	|	УчастникиГолосования.Использовать,
	|	СписокВопросов.Вопрос КАК Вопрос,
	|	ВариантыВыбораГолосования.ВариантРешения,
	|	УчастникиГолосования.Здание.Улица КАК Улица,
	|	УчастникиГолосования.Квартира,
	|	СписокВопросов.КритерийОценкиГолосов
	|ИЗ
	|	Документ.бит_СобраниеТСЖ.УчастникиГолосования КАК УчастникиГолосования
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокВопросов КАК СписокВопросов
	|		ПО УчастникиГолосования.ИдентификаторВопроса = СписокВопросов.Идентификатор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВариантыВыбораГолосования КАК ВариантыВыбораГолосования
	|		ПО УчастникиГолосования.ИдентификаторРешения = ВариантыВыбораГолосования.Идентификатор
	|ГДЕ
	|	УчастникиГолосования.Ссылка = &Ссылка
	|ИТОГИ
	|	МАКСИМУМ(Вопрос)
	|ПО
	|	ИдентификаторВопроса,
	|	Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокВопросов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВариантыВыбораГолосования";
	
	ВыборкаВопрос = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	УровеньВопрос = ДеревоУчастниковГолосования.ПолучитьЭлементы();
	УровеньВопрос.Очистить();
	
	Пока ВыборкаВопрос.Следующий() Цикл
		
		НоваяСтрокаВопрос = УровеньВопрос.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаВопрос, ВыборкаВопрос);
		НоваяСтрокаВопрос.Представление = ВыборкаВопрос.Вопрос;
		
		ВыборкаЗданий = ВыборкаВопрос.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		УровеньЗдание = НоваяСтрокаВопрос.ПолучитьЭлементы();
		
		Пока ВыборкаЗданий.Следующий() Цикл
			
			НоваяСтрокаЗдание = УровеньЗдание.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЗдание, ВыборкаЗданий);
			НоваяСтрокаЗдание.ЗданиеУчастник = ВыборкаЗданий.Здание; 
			НоваяСтрокаЗдание.Представление  = "ул. " + ВыборкаЗданий.Улица + ", д." + ВыборкаЗданий.Здание;
			
			ВыборкаУчастник = ВыборкаЗданий.Выбрать();
			УровеньУчасткин = НоваяСтрокаЗдание.ПолучитьЭлементы();
			
			Пока ВыборкаУчастник.Следующий() Цикл
				
				НоваяСтрокаУчастник = УровеньУчасткин.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаУчастник, ВыборкаУчастник);
				НоваяСтрокаУчастник.ЗданиеУчастник  = ВыборкаУчастник.Участник;
				НоваяСтрокаУчастник.Решение         = ВыборкаУчастник.ВариантРешения; 
				НоваяСтрокаУчастник.Представление   = "" + ВыборкаУчастник.Участник + ", кв." + ВыборкаУчастник.Квартира;
				НоваяСтрокаУчастник.УровеньУчастник = Истина
				
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокВопросов.Идентификатор,
	|	СписокВопросов.Вопрос
	|ПОМЕСТИТЬ СписокВопросов
	|ИЗ
	|	Документ.бит_СобраниеТСЖ.СписокВопросов КАК СписокВопросов
	|ГДЕ
	|	СписокВопросов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыВыбораГолосования.Идентификатор,
	|	ВариантыВыбораГолосования.ИдентификаторВопроса,
	|	ВариантыВыбораГолосования.ВариантРешения
	|ПОМЕСТИТЬ ВариантыВыбораГолосования
	|ИЗ
	|	Документ.бит_СобраниеТСЖ.ВариантыВыбораГолосования КАК ВариантыВыбораГолосования
	|ГДЕ
	|	ВариантыВыбораГолосования.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатыГолосования.ИдентификаторВопроса КАК ИдентификаторВопроса,
	|	РезультатыГолосования.ИдентификаторРешения,
	|	РезультатыГолосования.ЗначениеГолоса,
	|	СписокВопросов.Вопрос КАК Вопрос,
	|	ВариантыВыбораГолосования.ВариантРешения,
	|	РезультатыГолосования.ПроцентГолосов,
	|	РезультатыГолосования.ПринятоеРешение
	|ИЗ
	|	Документ.бит_СобраниеТСЖ.РезультатыГолосования КАК РезультатыГолосования
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокВопросов КАК СписокВопросов
	|		ПО РезультатыГолосования.ИдентификаторВопроса = СписокВопросов.Идентификатор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВариантыВыбораГолосования КАК ВариантыВыбораГолосования
	|		ПО РезультатыГолосования.ИдентификаторРешения = ВариантыВыбораГолосования.Идентификатор
	|ГДЕ
	|	РезультатыГолосования.Ссылка = &Ссылка
	|ИТОГИ
	|	МАКСИМУМ(Вопрос)
	|ПО
	|	ИдентификаторВопроса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокВопросов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВариантыВыбораГолосования";
	
	ВыборкаВопрос = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	УровеньВопрос = ДеревоРзельтатовГолосования.ПолучитьЭлементы();
	УровеньВопрос.Очистить();
	
	Пока ВыборкаВопрос.Следующий() Цикл
		
		НоваяСтрокаВопрос = УровеньВопрос.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаВопрос, ВыборкаВопрос);
		НоваяСтрокаВопрос.Вопрос = ВыборкаВопрос.Вопрос;
		
		ВыборкаРешений = ВыборкаВопрос.Выбрать();
		
		УровеньРешение = НоваяСтрокаВопрос.ПолучитьЭлементы();
		
		Пока ВыборкаРешений.Следующий() Цикл
			
			НоваяСтрокаРешение = УровеньРешение.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРешение, ВыборкаРешений); 
			НоваяСтрокаРешение.Вопрос = ВыборкаРешений.ВариантРешения;
			
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры // () 

&НаСервереБезКонтекста
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция СкопироватьУровень(Источник, ИмяКлюча, ИмяЗначения)
	
	Результат = Новый Соответствие;
	
	Для каждого СтрокаТаблицы Из Источник Цикл
		
		Результат.Вставить(СтрокаТаблицы[ИмяКлюча], СтрокаТаблицы[ИмяЗначения]);
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции // ()

&НаСервере
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ДобавитьОтборПроживающих()
	
	ТаблицаЗданий = Объект.СписокЗданий.Выгрузить();
	СписокЗданий  = ТаблицаЗданий.ВыгрузитьКолонку("Здание");
	
	ТаблицаСобствеников = ПолучитьСписокСобствениковДляОтбора(Объект.Дата, СписокЗданий);
	
	Отбор = Новый СписокЗначений;
	Отбор.ЗагрузитьЗначения(ТаблицаСобствеников.ВыгрузитьКолонку("ФизЛицо"));
	
	Возврат Отбор;
	
КонецФункции // ДобавитьОтборПроживающих()

&НаСервереБезКонтекста
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьСписокСобствениковДляОтбора(Период, СписокЗданий)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"      , КонецДня(Период));
	Запрос.УстановитьПараметр("СписокЗданий", СписокЗданий);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Период, ЛицевойСчет.Здание В (&СписокЗданий)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Период)
	|	И бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.даНет.да)";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ()

&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьЗначениеПоДереву(ИдентификаторВопроса, СтруктураЗначений, Отбор = Неопределено)
	
	ДеревоГолосования = РеквизитФормыВЗначение("ДеревоУчастниковГолосования", Тип("ДеревоЗначений"));
	
	ПоискВопроса = ДеревоГолосования.Строки.Найти(ИдентификаторВопроса, "ИдентификаторВопроса");
	
	Если ПоискВопроса = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого СтрокаОбъектаУчета Из ПоискВопроса.Строки Цикл
		
		Участники = СтрокаОбъектаУчета.Строки;
		
		Для каждого СтрокаУчастник Из Участники Цикл
			
			Если НЕ Отбор = Неопределено Тогда
				
				Отказ = Ложь;
				
				Для каждого ЭлементОтбора Из Отбор Цикл
					
					ЗначениеОтбора  = ЭлементОтбора.Значение;
					ЗначениеВСтроке = СтрокаУчастник[ЭлементОтбора.Ключ];
					
					Если НЕ ЗначениеВСтроке = ЗначениеОтбора Тогда
						Отказ = Истина;
					КонецЕсли; 
					
				КонецЦикла; 
				
				Если Отказ Тогда
					Продолжить;
				КонецЕсли;  
				
			КонецЕсли; 
			
			Для каждого ЭлементПоля Из СтруктураЗначений Цикл
				СтрокаУчастник[ЭлементПоля.Ключ] = ЭлементПоля.Значение;
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоГолосования, "ДеревоУчастниковГолосования");
	
КонецПроцедуры // () 

#КонецОбласти
